08-api/quoteshare/app/controllers/api/quotes_controller.rb

  def first3
    render json: Quote.limit(3)
---
SELECT  "quotes".* FROM "quotes" LIMIT $1  [["LIMIT", 3]]

  def search
    render json: Quote.where("content ilike '%#{params[:q]}%'")
---
SELECT "quotes".* FROM "quotes" WHERE (content ilike '%bad%')